songs = ["audio/chapter1.mp3", "song2.mp3", "song3.mp3"];
/*let paheli=[ज़रूर, यहाँ क्रमांकित पहेलियाँ दी गई हैं:

  1.  ऐसी कौन सी चीज़ है, जो लिख सकती है लेकिन पढ़ नहीं सकती? ✍️
      ➝ पेन (Pen)
  
  2.  मैं हमेशा आगे बढ़ता हूँ, लेकिन कभी पीछे नहीं जाता। बताओ मैं कौन हूँ? ️
      ➝ समय (Time)
  
  3.  ऐसी कौन सी चीज़ है, जो जितनी भरी होती है, उतना हल्की लगती है? 
      ➝ गुब्बारा (Balloon)
  
  4.  वो क्या है, जो जितना ज्यादा होता है, उतना ही कम दिखता है? ️
      ➝ अंधेरा (Darkness)
  
  5.  ऐसी कौन सी चीज़ है, जिसे खाने के लिए खरीदा जाता है, लेकिन खाया नहीं जाता? ️
      ➝ प्लेट (Plate) या चम्मच (Spoon)
  
  6.  मैं तुम्हारा हूँ, लेकिन दूसरे लोग मुझसे ज्यादा इस्तेमाल करते हैं। बताओ मैं कौन हूँ? 
      ➝ तुम्हारा नाम (Your Name)
  
  7.  ऐसा कौन सा सवाल है, जिसका जवाब हमेशा अलग होता है? ❓
      ➝ "अब कितने बजे हैं?" (What time is it?)
  
  8.  ऐसी कौन सी चीज़ है, जो हर इंसान को चाहिए, लेकिन जब मिलती है तो वो उसे फेंक देता है?
      ➝ लॉटरी का टिकट (Lottery Ticket)
  
  9.  ऐसी कौन सी चीज़ है, जो जितनी ज्यादा गंदी होती है, उतनी ही सफाई देती है? 
      ➝ साबुन (Soap)
  
  10. ऐसी कौन सी चीज़ है जो बिना पैरों के दौड़ सकती है? 
      ➝ नदी (River), हवा
  
  11. ऐसी कौन सी चीज़ है, जो सोने के लिए बनाई जाती है, लेकिन कभी नहीं सोती?
      ➝ पलंग (Bed)
  
  12. ऐसा कौन सा जीव है, जिसका दिल उसके सिर में होता है? 
      ➝ ऑक्टोपस (Octopus)
  
  13. वो क्या है जो बिना हाथ-पैर के सबको पकड़ सकती है? 
      ➝ बीमारी (Disease)
  
  14. ऐसी कौन सी चीज़ है, जिसे जितना निकालो, उतना ही बढ़ती जाती है?
      ➝ गड्ढा (Hole)
  
  15. ऐसी कौन सी चीज़ है, जो हाथों से नहीं पकड़ी जा सकती, लेकिन फिर भी सभी के पास होती है?
      ➝ छाया (Shadow) या नाम (Name)
  
  16. ऐसा कौन सा फल है, जिसे उल्टा करने और भी ज्यादा प्यारा बन जाती है?
      ➝ आम (Aam) → "माँ " (maA)
  
  17. ऐसी कौन सी चीज़ है, जो ऊपर जाती है लेकिन नीचे नहीं आती? 
      ➝ उम्र (Age)
  
  18. ऐसी कौन सी चीज़ है, जो काटने के बाद भी नहीं मरती? ✂️
      ➝ बाल और नाखून (Hair & Nails)
  
  19. ऐसा कौन सा Room है, जिसमें दरवाजे नहीं होते? 
      ➝ मशरूम (Mush-Room)
  
  20. ऐसा कौन सा शब्द है, जिसे हर कोई गलत ही बोलता है? 
      ➝ "गलत" (Wrong) 
  
  21. ऐसा क्या है, जो तुम्हारा ही होता है, लेकिन तुम्हारे अलावा उसे सब इस्तेमाल करते हैं? 
      ➝ तुम्हारा नाम (Your Name)
  
  22. ऐसा कौन सा पक्षी है, जो अंडे नहीं देता? 
      ➝ नर पक्षी (Male Bird) 
  
  23. ऐसी कौन सी चीज़ है, जो जितनी उम्र बढ़ती है, उतना ही छोटी होती जाती है? ️
      ➝ मोमबत्ती (Candle) या पेंसिल (Pencil)
  
  24. ऐसी कौन सी चीज़ है, जिसे सिर्फ एक बार इस्तेमाल कर सकते हैं? 
      ➝ माचिस की तीली (Matchstick)
  
  25. ऐसा कौन सा फल है, जिसे उल्टा करने पर मिठास बढ़ जाती है? 
      ➝ aam (आम) → उल्टा करने पर बनता है "maa"
  
  26. ऐसी कौन सी चीज़ है, जो बिना पेट्रोल के तेज दौड़ती है?
      ➝ हवा (Wind)
  
  27. ऐसी कौन सी चीज़ है, जो दिन में छुप जाती है लेकिन रात में दिखती है? 
      ➝ तारे (Stars)
  
  28. ऐसी कौन सी चीज़ है, जो सूरज से सबसे ज्यादा डरता, सामने तक नहीं आता? 
      ➝ तारे (Stars)
  
  29. ऐसा कौन सा शब्द है, जिसमें सारे अक्षर होते हैं? 
      ➝ अक्षरमाला (Alphabet)
  
  30. ऐसा कौन सा सवाल है, जिसका जवाब "हाँ" देने पर भी गलत होता है? ❌
      ➝ "क्या तुम सो रहे हो?" 
  
  31. ऐसी कौन सी चीज़ है, जिसे पानी में डालो तो वो भीगती नहीं? 
      ➝ परछाईं (Shadow)
  
  32. ऐसी कौन सी चीज़ है, जो हमेशा चलती रहती है लेकिन कहीं नहीं जाती?
      ➝ घड़ी (Clock)
  
  33. ऐसी कौन सी चीज़ है, जिसे हम देखते हैं लेकिन छू नहीं सकते? ☁️
      ➝ परछाईं (Shadow) या सपना (Dream)
  
  34. ऐसी कौन सी चीज़ है, जो गर्मी में ठंडी और ठंड में गर्म लगती है?
      ➝ ताजा पानी (Water)
  
  35. मेरा घर दरवाजे से निकल गया, लेकिन मैं नहीं निकल सकती। बताओ, मैं कौन हूँ? 
      उत्तर: मछली, पानी, जाल (दरवाजा) 
  
  36. साथ ही घर से निकलते हैं, साथ घर में घुसते हैं, पर बाहर कभी साथ नहीं रहते, कभी भी नहीं। बताओ, हम कौन हैं? 
      ➝ताला-चाबी
  
  37. ऐसी कौन सी चीज़ है, जो सभी को मुफ्त में मिली है लेकिन सबसे कीमती है?
      ➝ समय (Time)
  
  38. ऐसी कौन सी चीज़ है, जो रोज आती है, और इसी समय तुम्हारे दोस्त के यहा भी आई है?
      ➝ रात (Night)
  
  39. मैं हूँ सब्जियों की रानी, क्योंकि मुझे कटते और मरते देख लोगों को रोना आ जाता है। बताओ, मैं कौन हूँ? 
      उत्तर: प्याज (Onion) 
  
  40. ऐसी कौन सी चीज़ है, जो टूट जाती है, लेकिन उसे तोड़ने में आवाज नहीं होती?
      ➝ भरोसा (Trust)
  
  41. ऐसा कौन सा दांत है, जो किसी के मुंह में नहीं होता?
      ➝ आरी का दांत (Saw Teeth) या कुर्सी का दांत (Chair Teeth)
  
  42. ऐसी कौन सी चीज़ है, जो हर जगह होती है लेकिन कभी दिखाई नहीं देती?
      ➝ हवा (Air)
  
  43. ऐसा कौन सा सवाल है, जिसका जवाब हमेशा "हाँ" ही होगा?
      ➝ "क्या तुम जिंदा हो?," 
  
  44. ऐसी कौन सी चीज़ है, जो खुद तो खड़ी होती है लेकिन दूसरों को बैठाती है?
      ➝ कुर्सी (Chair)
  
  45. ऐसा कौन सा दो दरवाजा है, जो साथ खुलता-बंद होता रहता है, अकेले बंद हो जाये तो बवाल मैच जाये?
      ➝ आँखों का पलक (Eyelids)
  
  46. ऐसी कौन सी चीज़ है, जो बिना बोले सबकुछ बताया करती है?
      ➝ किताब (Book)
  
  47. ऐसी कौन सी चीज़ है, जिसे हमेशा अपने पास रखते हो, लेकिन देख नहीं सकते?
      ➝ यादें (Memories) या आत्मा (Soul)
  
  48. ऐसी कौन सी चीज़ है, जिसे साथ तो रखते है पर कभी छू नहीं सकते?
      ➝ यादें (Memories)
  ]*/
var data = {

  "Paheliya": {
    "Paheliya": '<div class="page"> <div class="a4page"> <table> <tr> <th>𓆩⚝𓆪 बच्चों के लिए पहेलियाँ</th> </tr> <tr> <td>P1 <a onclick="showAnswer(\'ans1\', \'पेन (Pen)✍️\', this)"> ⚝ </a> ऐसी कौन सी चीज़ है, जो लिख सकती है लेकिन पढ़ नहीं सकती?<span class="green" id="ans1"></span></td> </tr> <tr> <td>P2 <a onclick="showAnswer(\'ans2\', \'समय (Time) ️\', this)"> ⚝ </a> मैं हमेशा आगे बढ़ता हूँ, लेकिन कभी पीछे नहीं जाता। बताओ मैं कौन हूँ?<span class="green" id="ans2"></span></td> </tr> <tr> <td>P3 <a onclick="showAnswer(\'ans3\', \'गुब्बारा (Balloon) \', this)"> ⚝ </a> ऐसी कौन सी चीज़ है, जो जितनी भरी होती है, उतना हल्की लगती है?<span class="green" id="ans3"></span></td> </tr> <tr> <td>P4 <a onclick="showAnswer(\'ans4\', \'अंधेरा (Darkness) ️\', this)"> ⚝ </a> वो क्या है, जो जितना ज्यादा होता है, उतना ही कम दिखता है?<span class="green" id="ans4"></span></td> </tr> <tr> <td>P5 <a onclick="showAnswer(\'ans5\', \'प्लेट (Plate) या चम्मच (Spoon) ️\', this)"> ⚝ </a> ऐसी कौन सी चीज़ है, जिसे खाने के लिए खरीदा जाता है, लेकिन खाया नहीं जाता?<span class="green" id="ans5"></span></td> </tr> <tr> <td>P6 <a onclick="showAnswer(\'ans6\', \'तुम्हारा नाम (Your Name) \', this)"> ⚝ </a> मैं तुम्हारा हूँ, लेकिन दूसरे लोग मुझसे ज्यादा इस्तेमाल करते हैं। बताओ मैं कौन हूँ?<span class="green" id="ans6"></span></td> </tr> <tr> <td>P7 <a onclick="showAnswer(\'ans7\', \'अब कितने बजे हैं? (What time is it?) ❓\', this)"> ⚝ </a> ऐसा कौन सा सवाल है, जिसका जवाब हमेशा अलग होता है? <span class="green" id="ans7"></span></td> </tr> <tr> <td>P8 <a onclick="showAnswer(\'ans8\', \'लॉटरी का टिकट (Lottery Ticket)\', this)"> ⚝ </a> ऐसी कौन सी चीज़ है, जो हर इंसान को चाहिए, लेकिन जब मिलती है तो वो उसे फेंक देता है?<span class="green" id="ans8"></span></td> </tr> <tr> <td>P9 <a onclick="showAnswer(\'ans9\', \'साबुन (Soap) \', this)"> ⚝ </a> ऐसी कौन सी चीज़ है, जो जितनी ज्यादा गंदी होती है, उतनी ही सफाई देती है?<span class="green" id="ans9"></span></td> </tr> <tr> <td>P10 <a onclick="showAnswer(\'ans10\', \'नदी (River), हवा \', this)"> ⚝ </a> ऐसी कौन सी चीज़ है जो बिना पैरों के दौड़ सकती है?<span class="green" id="ans10"></span></td> </tr> <tr> <td>P11 <a onclick="showAnswer(\'ans11\', \'पलंग (Bed)\', this)"> ⚝ </a> ऐसी कौन सी चीज़ है, जो सोने के लिए बनाई जाती है, लेकिन कभी नहीं सोती?<span class="green" id="ans11"></span></td> </tr> <tr> <td>P12 <a onclick="showAnswer(\'ans12\', \'ऑक्टोपस (Octopus) \', this)"> ⚝ </a> ऐसा कौन सा जीव है, जिसका दिल उसके सिर में होता है?<span class="green" id="ans12"></span></td> </tr> <tr> <td>P13 <a onclick="showAnswer(\'ans13\', \'बीमारी (Disease) \', this)"> ⚝ </a> वो क्या है जो बिना हाथ-पैर के सबको पकड़ सकती है?<span class="green" id="ans13"></span></td> </tr> <tr> <td>P14 <a onclick="showAnswer(\'ans14\', \'गड्ढा (Hole)\', this)"> ⚝ </a> ऐसी कौन सी चीज़ है, जिसे जितना निकालो, उतना ही बढ़ती जाती है?<span class="green" id="ans14"></span></td> </tr> <tr> <td>P15 <a onclick="showAnswer(\'ans15\', \'छाया (Shadow) या नाम (Name)\', this)"> ⚝ </a> ऐसी कौन सी चीज़ है, जो हाथों से नहीं पकड़ी जा सकती, लेकिन फिर भी सभी के पास होती है?<span class="green" id="ans15"></span></td> </tr> <tr> <td>P16 <a onclick="showAnswer(\'ans16\', \'आम (Aam) →  माँ  (maA)\', this)"> ⚝ </a> ऐसा कौन सा फल है, जिसे उल्टा करने और भी ज्यादा प्यारा बन जाती है?<span class="green" id="ans16"></span></td> </tr> <tr> <td>P17 <a onclick="showAnswer(\'ans17\', \'उम्र (Age) \', this)"> ⚝ </a> ऐसी कौन सी चीज़ है, जो ऊपर जाती है लेकिन नीचे नहीं आती?<span class="green" id="ans17"></span></td> </tr> <tr> <td>P18 <a onclick="showAnswer(\'ans18\', \'बाल और नाखून (Hair & Nails) ✂️\', this)"> ⚝ </a> ऐसी कौन सी चीज़ है, जो काटने के बाद भी नहीं मरती?<span class="green" id="ans18"></span></td> </tr> <tr> <td>P19 <a onclick="showAnswer(\'ans19\', \'मशरूम (Mush-Room) \', this)"> ⚝ </a> ऐसा कौन सा Room है, जिसमें दरवाजे नहीं होते?<span class="green" id="ans19"></span></td> </tr> <tr> <td>P20 <a onclick="showAnswer(\'ans20\', \' गलत (Wrong) \', this)"> ⚝ </a> ऐसा कौन सा शब्द है, जिसे हर कोई गलत ही बोलता है?<span class="green" id="ans20"></span></td> </tr> <tr> <td>P21 <a onclick="showAnswer(\' ans21\', \'तुम्हारा नाम (Your Name) \' , this)"> ⚝ </a> ऐसा क्या है, जो तुम्हारा ही होता है, लेकिन तुम्हारे अलावा उसे सब इस्तेमाल करते हैं?<span class="green" id="ans21"></span></td> </tr> <tr> <td>P22 <a onclick="showAnswer(\'ans22\', \'नर पक्षी (Male Bird) \', this)"> ⚝ </a> ऐसा कौन सा पक्षी है, जो अंडे नहीं देता?<span class="green" id="ans22"></span></td> </tr> <tr> <td>P23 <a onclick="showAnswer(\'ans23\', \'मोमबत्ती (Candle) या पेंसिल (Pencil) ️\', this)"> ⚝ </a> ऐसी कौन सी चीज़ है, जो जितनी उम्र बढ़ती है, उतना ही छोटी होती जाती है?<span class="green" id="ans23"></span></td> </tr> <tr> <td>P24 <a onclick="showAnswer(\'ans24\', \'माचिस की तीली (Matchstick) \', this)"> ⚝ </a> ऐसी कौन सी चीज़ है, जिसे सिर्फ एक बार इस्तेमाल कर सकते हैं?<span class="green" id="ans24"></span></td> </tr> <tr> <td>P25 <a onclick="showAnswer(\'ans25\', \'aam (आम) → उल्टा करने पर बनता है  maa \', this)"> ⚝ </a> ऐसा कौन सा फल है, जिसे उल्टा करने पर मिठास बढ़ जाती है?<span class="green" id="ans25"></span></td> </tr> <tr> <td>P26 <a onclick="showAnswer(\' ans26\', \'हवा (Wind)\' , this)"> ⚝ </a> ऐसी कौन सी चीज़ है, जो बिना पेट्रोल के तेज दौड़ती है?<span class="green" id="ans26"></span></td> </tr> <tr> <td>P27 <a onclick="showAnswer(\'ans27\', \'तारे (Stars) 🌙\', this)"> ⚝ </a> ऐसी कौन सी चीज़ है, जो दिन में छुप जाती है लेकिन रात में दिखती है?<span class="green" id="ans27"></span></td> </tr> <tr> <td>P28 <a onclick="showAnswer(\'ans28\', \'तारे (Stars) 🌙\', this)"> ⚝ </a> ऐसी कौन सी चीज़ है, जो सूरज से सबसे ज्यादा डरता, सामने तक नहीं आता?<span class="green" id="ans28"></span></td> </tr> <tr> <td>P29 <a onclick="showAnswer(\'ans29\', \'अक्षरमाला (Alphabet) 🔡\', this)"> ⚝ </a> ऐसा कौन सा शब्द है, जिसमें सारे अक्षर होते हैं?<span class="green" id="ans29"></span></td> </tr> <tr> <td>P30 <a onclick="showAnswer(\'ans30\', \' क्या तुम सो रहे हो? 😂\', this)"> ⚝ </a> ऐसा कौन सा सवाल है, जिसका जवाब "हाँ" देने पर भी गलत होता है?<span class="green" id="ans30"></span></td> </tr> <tr> <td>P31 <a onclick="showAnswer(\'ans31\', \'परछाईं (Shadow) 🌊\', this)"> ⚝ </a> ऐसी कौन सी चीज़ है, जिसे पानी में डालो तो वो भीगती नहीं?<span class="green" id="ans31"></span></td> </tr> <tr> <td>P32 <a onclick="showAnswer(\'ans32\', \'घड़ी (Clock) 🕰️\', this)"> ⚝ </a> ऐसी कौन सी चीज़ है, जो हमेशा चलती रहती है लेकिन कहीं नहीं जाती?<span class="green" id="ans32"></span></td> </tr> <tr> <td>P33 <a onclick="showAnswer(\'ans33\', \'परछाईं (Shadow) या सपना (Dream) ☁️\', this)"> ⚝ </a> ऐसी कौन सी चीज़ है, जिसे हम देखते हैं लेकिन छू नहीं सकते?<span class="green" id="ans33"></span></td> </tr> <tr> <td>P34 <a onclick="showAnswer(\'ans34\', \'ताजा पानी (Water) 💧\', this)"> ⚝ </a> ऐसी कौन सी चीज़ है, जो गर्मी में ठंडी और ठंड में गर्म लगती है?<span class="green" id="ans34"></span></td> </tr> <tr> <td>P35 <a onclick="showAnswer(\'ans35\', \'मछली, पानी, जाल (दरवाजा) 🐟\', this)"> ⚝ </a> मेरा घर दरवाजे से निकल गया, लेकिन मैं नहीं निकल सकती। बताओ, मैं कौन हूँ?<span class="green" id="ans35"></span></td> </tr> <tr> <td>P36 <a onclick="showAnswer(\'ans36\', \'ताला-चाबी 🔑\', this)"> ⚝ </a> साथ ही घर से निकलते हैं, साथ घर में घुसते हैं, पर बाहर कभी साथ नहीं रहते, कभी भी नहीं। बताओ, हम कौन हैं?<span class="green" id="ans36"></span></td> </tr> <tr> <td>P37 <a onclick="showAnswer(\'ans37\', \'समय (Time) ⏳\', this)"> ⚝ </a> ऐसी कौन सी चीज़ है, जो सभी को मुफ्त में मिली है लेकिन सबसे कीमती है?<span class="green" id="ans37"></span></td> </tr> <tr> <td>P38 <a onclick="showAnswer(\'ans38\', \'रात (Night) 🌃\', this)"> ⚝ </a> ऐसी कौन सी चीज़ है, जो रोज आती है, और इसी समय तुम्हारे दोस्त के यहा भी आई है?<span class="green" id="ans38"></span></td> </tr> <tr> <td>P39 <a onclick="showAnswer(\'ans39\', \'प्याज (Onion) 🧅\', this)"> ⚝ </a> मैं हूँ सब्जियों की रानी, क्योंकि मुझे कटते और मरते देख लोगों को रोना आ जाता है। बताओ, मैं कौन हूँ?<span class="green" id="ans39"></span></td> </tr> <tr> <td>P40 <a onclick="showAnswer(\'ans40\', \'भरोसा (Trust) 💔\', this)"> ⚝ </a> ऐसी कौन सी चीज़ है, जो टूट जाती है, लेकिन उसे तोड़ने में आवाज नहीं होती?<span class="green" id="ans40"></span></td> </tr> <tr> <td>P41 <a onclick="showAnswer(\'ans41\', \'आरी का दांत (Saw Teeth) या कुर्सी का दांत (Chair Teeth) 🦷\', this)"> ⚝ </a> ऐसा कौन सा दांत है, जो किसी के मुंह में नहीं होता?<span class="green" id="ans41"></span></td> </tr> <tr> <td>P42 <a onclick="showAnswer(\'ans42\', \'हवा (Air) 🌬️\', this)"> ⚝ </a> ऐसी कौन सी चीज़ है, जो हर जगह होती है लेकिन कभी दिखाई नहीं देती?<span class="green" id="ans42"></span></td> </tr> <tr> <td>P43 <a onclick="showAnswer(\'ans43\', \' क्या तुम जिंदा हो? 😂\', this)"> ⚝ </a> ऐसा कौन सा सवाल है, जिसका जवाब हमेशा "हाँ" ही होगा?<span class="green" id="ans43"></span></td> </tr> <tr> <td>P44 <a onclick="showAnswer(\'ans44\', \'कुर्सी (Chair) 🪑\', this)"> ⚝ </a> ऐसी कौन सी चीज़ है, जो खुद तो खड़ी होती है लेकिन दूसरों को बैठाती है?<span class="green" id="ans44"></span></td> </tr> <tr> <td>P45 <a onclick="showAnswer(\'ans45\', \'आँखों का पलक (Eyelids) 👀\', this)"> ⚝ </a> ऐसा कौन सा दो दरवाजा है, जो साथ खुलता-बंद होता रहता है, अकेले बंद हो जाये तो बवाल मैच जाये?<span class="green" id="ans45"></span></td> </tr> <tr> <td>P46 <a onclick="showAnswer(\'ans46\', \'किताब (Book) 📖\', this)"> ⚝ </a> ऐसी कौन सी चीज़ है, जो बिना बोले सबकुछ बताया करती है?<span class="green" id="ans46"></span></td> </tr> <tr> <td>P47 <a onclick="showAnswer(\'ans47\', \'यादें (Memories) या आत्मा (Soul) 💭\', this)"> ⚝ </a> ऐसी कौन सी चीज़ है, जिसे हमेशा अपने पास रखते हो, लेकिन देख नहीं सकते?<span class="green" id="ans47"></span></td> </tr> <tr> <td>P48 <a onclick="showAnswer(\'ans48\', \'यादें (Memories) 💭\', this)"> ⚝ </a> ऐसी कौन सी चीज़ है, जिसे साथ तो रखते है पर कभी छू नहीं सकते?<span class="green" id="ans48"></span></td> </tr> </table> </div> </div>',
  },
};

generateSidebar(); 

