const Fruits = [
      ["𓆩⚝𓆪", "Fruit Name", "Meaning", "Pronunciation"],
      ["1", "Mango", "आम", "मैंगो"],
      ["2", "Banana", "केला", "बनाना"],
      ["3", "Apple", "सेब", "एप्पल"],
      ["4", "Orange", "संतरा", "ऑरेंज"],
      ["5", "Guava", "अमरूद", "ग्वावा"],
      ["6", "Pineapple", "अनानास", "पाइनएप्पल"],
      ["7", "Papaya", "पपीता", "पपाया"],
      ["8", "Watermelon", "तरबूज", "वॉटरमेलन"],
      ["9", "Muskmelon", "खरबूजा", "मस्कमेलन"],
      ["10", "Litchi", "लीची", "लीची"]
    ];

    const Vegetables = [
      ["𓆩⚝𓆪", "Vegetable Name", "Meaning", "Pronunciation"],
      ["1", "Carrot", "गाजर", "कैरेट"],
      ["2", "Potato", "आलू", "पोटैटो"],
      ["3", "Tomato", "टमाटर", "टोमेटो"],
      ["4", "Onion", "प्याज", "अनियन"],
      ["5", "Cabbage", "पत्ता गोभी", "कैबेज"],
      ["6", "Spinach", "पालक", "स्पिनच"],
      ["7", "Peas", "मटर", "पीज"],
      ["8", "Cauliflower", "फूलगोभी", "कॉलीफ्लावर"],
      ["9", "Radish", "मूली", "रैडिश"],
      ["10", "Brinjal", "बैंगन", "ब्रिंजल"]
    ];

    const Animals = [
      ["𓆩⚝𓆪", "Animal Name", "Meaning", "Pronunciation"],
      ["1", "Dog", "कुत्ता", "डॉग"],
      ["2", "Cat", "बिल्ली", "कैट"],
      ["3", "Cow", "गाय", "काऊ"],
      ["4", "Buffalo", "भैंस", "बफेलो"],
      ["5", "Goat", "बकरी", "गोट"],
      ["6", "Sheep", "भेड़", "शीप"],
      ["7", "Horse", "घोड़ा", "हॉर्स"],
      ["8", "Elephant", "हाथी", "एलीफेंट"],
      ["9", "Lion", "शेर", "लायन"],
      ["10", "Tiger", "बाघ", "टाइगर"],
      ["11", "Monkey", "बंदर", "मंकी"],
      ["12", "Donkey", "गधा", "डंकी"],
      ["13", "Camel", "ऊँट", "कैमल"],
      ["14", "Rabbit", "खरगोश", "रैबिट"],
      ["15", "Bear", "भालू", "बेयर"],
      ["16", "Wolf", "भेड़िया", "वुल्फ"],
      ["17", "Fox", "लोमड़ी", "फॉक्स"],
      ["18", "Pig", "सूअर", "पिग"],
      ["19", "Deer", "हिरण", "डियर"],
      ["20", "Crocodile", "मगरमच्छ", "क्रोकोडाइल"]
    ];


